grevaillot/svd_tools/headers/ATSAMR21E16A/port_iobus.h
#pragma once 

/* --- PORT_IOBUS: Port Module (IOBUS) ------------------------------ */

/** @defgroup port_iobus_registers Port Module (IOBUS) Register
@{*/

/** PORT_IOBUS_DIR0 Data Direction **/
#define PORT_IOBUS_DIR0			MMIO32(PORT_IOBUS_BASE + 0x00)
/** PORT_IOBUS_DIRCLR0 Data Direction Clear **/
#define PORT_IOBUS_DIRCLR0			MMIO32(PORT_IOBUS_BASE + 0x04)
/** PORT_IOBUS_DIRSET0 Data Direction Set **/
#define PORT_IOBUS_DIRSET0			MMIO32(PORT_IOBUS_BASE + 0x08)
/** PORT_IOBUS_DIRTGL0 Data Direction Toggle **/
#define PORT_IOBUS_DIRTGL0			MMIO32(PORT_IOBUS_BASE + 0x0c)
/** PORT_IOBUS_OUT0 Data Output Value **/
#define PORT_IOBUS_OUT0			MMIO32(PORT_IOBUS_BASE + 0x10)
/** PORT_IOBUS_OUTCLR0 Data Output Value Clear **/
#define PORT_IOBUS_OUTCLR0			MMIO32(PORT_IOBUS_BASE + 0x14)
/** PORT_IOBUS_OUTSET0 Data Output Value Set **/
#define PORT_IOBUS_OUTSET0			MMIO32(PORT_IOBUS_BASE + 0x18)
/** PORT_IOBUS_OUTTGL0 Data Output Value Toggle **/
#define PORT_IOBUS_OUTTGL0			MMIO32(PORT_IOBUS_BASE + 0x1c)
/** PORT_IOBUS_IN0 Data Input Value **/
#define PORT_IOBUS_IN0			MMIO32(PORT_IOBUS_BASE + 0x20)
/** PORT_IOBUS_CTRL0 Control **/
#define PORT_IOBUS_CTRL0			MMIO32(PORT_IOBUS_BASE + 0x24)
/** PORT_IOBUS_WRCONFIG0 Write Configuration **/
#define PORT_IOBUS_WRCONFIG0			MMIO32(PORT_IOBUS_BASE + 0x28)
/** PORT_IOBUS_PMUX0_0 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_0			MMIO32(PORT_IOBUS_BASE + 0x30)
/** PORT_IOBUS_PMUX0_1 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_1			MMIO32(PORT_IOBUS_BASE + 0x31)
/** PORT_IOBUS_PMUX0_2 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_2			MMIO32(PORT_IOBUS_BASE + 0x32)
/** PORT_IOBUS_PMUX0_3 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_3			MMIO32(PORT_IOBUS_BASE + 0x33)
/** PORT_IOBUS_PMUX0_4 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_4			MMIO32(PORT_IOBUS_BASE + 0x34)
/** PORT_IOBUS_PMUX0_5 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_5			MMIO32(PORT_IOBUS_BASE + 0x35)
/** PORT_IOBUS_PMUX0_6 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_6			MMIO32(PORT_IOBUS_BASE + 0x36)
/** PORT_IOBUS_PMUX0_7 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_7			MMIO32(PORT_IOBUS_BASE + 0x37)
/** PORT_IOBUS_PMUX0_8 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_8			MMIO32(PORT_IOBUS_BASE + 0x38)
/** PORT_IOBUS_PMUX0_9 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_9			MMIO32(PORT_IOBUS_BASE + 0x39)
/** PORT_IOBUS_PMUX0_10 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_10			MMIO32(PORT_IOBUS_BASE + 0x3a)
/** PORT_IOBUS_PMUX0_11 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_11			MMIO32(PORT_IOBUS_BASE + 0x3b)
/** PORT_IOBUS_PMUX0_12 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_12			MMIO32(PORT_IOBUS_BASE + 0x3c)
/** PORT_IOBUS_PMUX0_13 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_13			MMIO32(PORT_IOBUS_BASE + 0x3d)
/** PORT_IOBUS_PMUX0_14 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_14			MMIO32(PORT_IOBUS_BASE + 0x3e)
/** PORT_IOBUS_PMUX0_15 Peripheral Multiplexing n - Group 0 **/
#define PORT_IOBUS_PMUX0_15			MMIO32(PORT_IOBUS_BASE + 0x3f)
/** PORT_IOBUS_PINCFG0_0 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_0			MMIO32(PORT_IOBUS_BASE + 0x40)
/** PORT_IOBUS_PINCFG0_1 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_1			MMIO32(PORT_IOBUS_BASE + 0x41)
/** PORT_IOBUS_PINCFG0_2 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_2			MMIO32(PORT_IOBUS_BASE + 0x42)
/** PORT_IOBUS_PINCFG0_3 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_3			MMIO32(PORT_IOBUS_BASE + 0x43)
/** PORT_IOBUS_PINCFG0_4 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_4			MMIO32(PORT_IOBUS_BASE + 0x44)
/** PORT_IOBUS_PINCFG0_5 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_5			MMIO32(PORT_IOBUS_BASE + 0x45)
/** PORT_IOBUS_PINCFG0_6 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_6			MMIO32(PORT_IOBUS_BASE + 0x46)
/** PORT_IOBUS_PINCFG0_7 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_7			MMIO32(PORT_IOBUS_BASE + 0x47)
/** PORT_IOBUS_PINCFG0_8 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_8			MMIO32(PORT_IOBUS_BASE + 0x48)
/** PORT_IOBUS_PINCFG0_9 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_9			MMIO32(PORT_IOBUS_BASE + 0x49)
/** PORT_IOBUS_PINCFG0_10 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_10			MMIO32(PORT_IOBUS_BASE + 0x4a)
/** PORT_IOBUS_PINCFG0_11 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_11			MMIO32(PORT_IOBUS_BASE + 0x4b)
/** PORT_IOBUS_PINCFG0_12 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_12			MMIO32(PORT_IOBUS_BASE + 0x4c)
/** PORT_IOBUS_PINCFG0_13 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_13			MMIO32(PORT_IOBUS_BASE + 0x4d)
/** PORT_IOBUS_PINCFG0_14 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_14			MMIO32(PORT_IOBUS_BASE + 0x4e)
/** PORT_IOBUS_PINCFG0_15 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_15			MMIO32(PORT_IOBUS_BASE + 0x4f)
/** PORT_IOBUS_PINCFG0_16 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_16			MMIO32(PORT_IOBUS_BASE + 0x50)
/** PORT_IOBUS_PINCFG0_17 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_17			MMIO32(PORT_IOBUS_BASE + 0x51)
/** PORT_IOBUS_PINCFG0_18 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_18			MMIO32(PORT_IOBUS_BASE + 0x52)
/** PORT_IOBUS_PINCFG0_19 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_19			MMIO32(PORT_IOBUS_BASE + 0x53)
/** PORT_IOBUS_PINCFG0_20 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_20			MMIO32(PORT_IOBUS_BASE + 0x54)
/** PORT_IOBUS_PINCFG0_21 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_21			MMIO32(PORT_IOBUS_BASE + 0x55)
/** PORT_IOBUS_PINCFG0_22 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_22			MMIO32(PORT_IOBUS_BASE + 0x56)
/** PORT_IOBUS_PINCFG0_23 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_23			MMIO32(PORT_IOBUS_BASE + 0x57)
/** PORT_IOBUS_PINCFG0_24 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_24			MMIO32(PORT_IOBUS_BASE + 0x58)
/** PORT_IOBUS_PINCFG0_25 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_25			MMIO32(PORT_IOBUS_BASE + 0x59)
/** PORT_IOBUS_PINCFG0_26 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_26			MMIO32(PORT_IOBUS_BASE + 0x5a)
/** PORT_IOBUS_PINCFG0_27 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_27			MMIO32(PORT_IOBUS_BASE + 0x5b)
/** PORT_IOBUS_PINCFG0_28 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_28			MMIO32(PORT_IOBUS_BASE + 0x5c)
/** PORT_IOBUS_PINCFG0_29 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_29			MMIO32(PORT_IOBUS_BASE + 0x5d)
/** PORT_IOBUS_PINCFG0_30 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_30			MMIO32(PORT_IOBUS_BASE + 0x5e)
/** PORT_IOBUS_PINCFG0_31 Pin Configuration n - Group 0 **/
#define PORT_IOBUS_PINCFG0_31			MMIO32(PORT_IOBUS_BASE + 0x5f)
/** PORT_IOBUS_DIR1 Data Direction **/
#define PORT_IOBUS_DIR1			MMIO32(PORT_IOBUS_BASE + 0x80)
/** PORT_IOBUS_DIRCLR1 Data Direction Clear **/
#define PORT_IOBUS_DIRCLR1			MMIO32(PORT_IOBUS_BASE + 0x84)
/** PORT_IOBUS_DIRSET1 Data Direction Set **/
#define PORT_IOBUS_DIRSET1			MMIO32(PORT_IOBUS_BASE + 0x88)
/** PORT_IOBUS_DIRTGL1 Data Direction Toggle **/
#define PORT_IOBUS_DIRTGL1			MMIO32(PORT_IOBUS_BASE + 0x8c)
/** PORT_IOBUS_OUT1 Data Output Value **/
#define PORT_IOBUS_OUT1			MMIO32(PORT_IOBUS_BASE + 0x90)
/** PORT_IOBUS_OUTCLR1 Data Output Value Clear **/
#define PORT_IOBUS_OUTCLR1			MMIO32(PORT_IOBUS_BASE + 0x94)
/** PORT_IOBUS_OUTSET1 Data Output Value Set **/
#define PORT_IOBUS_OUTSET1			MMIO32(PORT_IOBUS_BASE + 0x98)
/** PORT_IOBUS_OUTTGL1 Data Output Value Toggle **/
#define PORT_IOBUS_OUTTGL1			MMIO32(PORT_IOBUS_BASE + 0x9c)
/** PORT_IOBUS_IN1 Data Input Value **/
#define PORT_IOBUS_IN1			MMIO32(PORT_IOBUS_BASE + 0xa0)
/** PORT_IOBUS_CTRL1 Control **/
#define PORT_IOBUS_CTRL1			MMIO32(PORT_IOBUS_BASE + 0xa4)
/** PORT_IOBUS_WRCONFIG1 Write Configuration **/
#define PORT_IOBUS_WRCONFIG1			MMIO32(PORT_IOBUS_BASE + 0xa8)
/** PORT_IOBUS_PMUX1_0 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_0			MMIO32(PORT_IOBUS_BASE + 0xb0)
/** PORT_IOBUS_PMUX1_1 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_1			MMIO32(PORT_IOBUS_BASE + 0xb1)
/** PORT_IOBUS_PMUX1_2 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_2			MMIO32(PORT_IOBUS_BASE + 0xb2)
/** PORT_IOBUS_PMUX1_3 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_3			MMIO32(PORT_IOBUS_BASE + 0xb3)
/** PORT_IOBUS_PMUX1_4 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_4			MMIO32(PORT_IOBUS_BASE + 0xb4)
/** PORT_IOBUS_PMUX1_5 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_5			MMIO32(PORT_IOBUS_BASE + 0xb5)
/** PORT_IOBUS_PMUX1_6 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_6			MMIO32(PORT_IOBUS_BASE + 0xb6)
/** PORT_IOBUS_PMUX1_7 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_7			MMIO32(PORT_IOBUS_BASE + 0xb7)
/** PORT_IOBUS_PMUX1_8 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_8			MMIO32(PORT_IOBUS_BASE + 0xb8)
/** PORT_IOBUS_PMUX1_9 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_9			MMIO32(PORT_IOBUS_BASE + 0xb9)
/** PORT_IOBUS_PMUX1_10 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_10			MMIO32(PORT_IOBUS_BASE + 0xba)
/** PORT_IOBUS_PMUX1_11 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_11			MMIO32(PORT_IOBUS_BASE + 0xbb)
/** PORT_IOBUS_PMUX1_12 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_12			MMIO32(PORT_IOBUS_BASE + 0xbc)
/** PORT_IOBUS_PMUX1_13 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_13			MMIO32(PORT_IOBUS_BASE + 0xbd)
/** PORT_IOBUS_PMUX1_14 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_14			MMIO32(PORT_IOBUS_BASE + 0xbe)
/** PORT_IOBUS_PMUX1_15 Peripheral Multiplexing n - Group 1 **/
#define PORT_IOBUS_PMUX1_15			MMIO32(PORT_IOBUS_BASE + 0xbf)
/** PORT_IOBUS_PINCFG1_0 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_0			MMIO32(PORT_IOBUS_BASE + 0xc0)
/** PORT_IOBUS_PINCFG1_1 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_1			MMIO32(PORT_IOBUS_BASE + 0xc1)
/** PORT_IOBUS_PINCFG1_2 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_2			MMIO32(PORT_IOBUS_BASE + 0xc2)
/** PORT_IOBUS_PINCFG1_3 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_3			MMIO32(PORT_IOBUS_BASE + 0xc3)
/** PORT_IOBUS_PINCFG1_4 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_4			MMIO32(PORT_IOBUS_BASE + 0xc4)
/** PORT_IOBUS_PINCFG1_5 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_5			MMIO32(PORT_IOBUS_BASE + 0xc5)
/** PORT_IOBUS_PINCFG1_6 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_6			MMIO32(PORT_IOBUS_BASE + 0xc6)
/** PORT_IOBUS_PINCFG1_7 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_7			MMIO32(PORT_IOBUS_BASE + 0xc7)
/** PORT_IOBUS_PINCFG1_8 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_8			MMIO32(PORT_IOBUS_BASE + 0xc8)
/** PORT_IOBUS_PINCFG1_9 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_9			MMIO32(PORT_IOBUS_BASE + 0xc9)
/** PORT_IOBUS_PINCFG1_10 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_10			MMIO32(PORT_IOBUS_BASE + 0xca)
/** PORT_IOBUS_PINCFG1_11 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_11			MMIO32(PORT_IOBUS_BASE + 0xcb)
/** PORT_IOBUS_PINCFG1_12 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_12			MMIO32(PORT_IOBUS_BASE + 0xcc)
/** PORT_IOBUS_PINCFG1_13 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_13			MMIO32(PORT_IOBUS_BASE + 0xcd)
/** PORT_IOBUS_PINCFG1_14 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_14			MMIO32(PORT_IOBUS_BASE + 0xce)
/** PORT_IOBUS_PINCFG1_15 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_15			MMIO32(PORT_IOBUS_BASE + 0xcf)
/** PORT_IOBUS_PINCFG1_16 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_16			MMIO32(PORT_IOBUS_BASE + 0xd0)
/** PORT_IOBUS_PINCFG1_17 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_17			MMIO32(PORT_IOBUS_BASE + 0xd1)
/** PORT_IOBUS_PINCFG1_18 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_18			MMIO32(PORT_IOBUS_BASE + 0xd2)
/** PORT_IOBUS_PINCFG1_19 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_19			MMIO32(PORT_IOBUS_BASE + 0xd3)
/** PORT_IOBUS_PINCFG1_20 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_20			MMIO32(PORT_IOBUS_BASE + 0xd4)
/** PORT_IOBUS_PINCFG1_21 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_21			MMIO32(PORT_IOBUS_BASE + 0xd5)
/** PORT_IOBUS_PINCFG1_22 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_22			MMIO32(PORT_IOBUS_BASE + 0xd6)
/** PORT_IOBUS_PINCFG1_23 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_23			MMIO32(PORT_IOBUS_BASE + 0xd7)
/** PORT_IOBUS_PINCFG1_24 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_24			MMIO32(PORT_IOBUS_BASE + 0xd8)
/** PORT_IOBUS_PINCFG1_25 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_25			MMIO32(PORT_IOBUS_BASE + 0xd9)
/** PORT_IOBUS_PINCFG1_26 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_26			MMIO32(PORT_IOBUS_BASE + 0xda)
/** PORT_IOBUS_PINCFG1_27 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_27			MMIO32(PORT_IOBUS_BASE + 0xdb)
/** PORT_IOBUS_PINCFG1_28 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_28			MMIO32(PORT_IOBUS_BASE + 0xdc)
/** PORT_IOBUS_PINCFG1_29 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_29			MMIO32(PORT_IOBUS_BASE + 0xdd)
/** PORT_IOBUS_PINCFG1_30 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_30			MMIO32(PORT_IOBUS_BASE + 0xde)
/** PORT_IOBUS_PINCFG1_31 Pin Configuration n - Group 1 **/
#define PORT_IOBUS_PINCFG1_31			MMIO32(PORT_IOBUS_BASE + 0xdf)
/** PORT_IOBUS_DIR2 Data Direction **/
#define PORT_IOBUS_DIR2			MMIO32(PORT_IOBUS_BASE + 0x100)
/** PORT_IOBUS_DIRCLR2 Data Direction Clear **/
#define PORT_IOBUS_DIRCLR2			MMIO32(PORT_IOBUS_BASE + 0x104)
/** PORT_IOBUS_DIRSET2 Data Direction Set **/
#define PORT_IOBUS_DIRSET2			MMIO32(PORT_IOBUS_BASE + 0x108)
/** PORT_IOBUS_DIRTGL2 Data Direction Toggle **/
#define PORT_IOBUS_DIRTGL2			MMIO32(PORT_IOBUS_BASE + 0x10c)
/** PORT_IOBUS_OUT2 Data Output Value **/
#define PORT_IOBUS_OUT2			MMIO32(PORT_IOBUS_BASE + 0x110)
/** PORT_IOBUS_OUTCLR2 Data Output Value Clear **/
#define PORT_IOBUS_OUTCLR2			MMIO32(PORT_IOBUS_BASE + 0x114)
/** PORT_IOBUS_OUTSET2 Data Output Value Set **/
#define PORT_IOBUS_OUTSET2			MMIO32(PORT_IOBUS_BASE + 0x118)
/** PORT_IOBUS_OUTTGL2 Data Output Value Toggle **/
#define PORT_IOBUS_OUTTGL2			MMIO32(PORT_IOBUS_BASE + 0x11c)
/** PORT_IOBUS_IN2 Data Input Value **/
#define PORT_IOBUS_IN2			MMIO32(PORT_IOBUS_BASE + 0x120)
/** PORT_IOBUS_CTRL2 Control **/
#define PORT_IOBUS_CTRL2			MMIO32(PORT_IOBUS_BASE + 0x124)
/** PORT_IOBUS_WRCONFIG2 Write Configuration **/
#define PORT_IOBUS_WRCONFIG2			MMIO32(PORT_IOBUS_BASE + 0x128)
/** PORT_IOBUS_PMUX2_0 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_0			MMIO32(PORT_IOBUS_BASE + 0x130)
/** PORT_IOBUS_PMUX2_1 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_1			MMIO32(PORT_IOBUS_BASE + 0x131)
/** PORT_IOBUS_PMUX2_2 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_2			MMIO32(PORT_IOBUS_BASE + 0x132)
/** PORT_IOBUS_PMUX2_3 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_3			MMIO32(PORT_IOBUS_BASE + 0x133)
/** PORT_IOBUS_PMUX2_4 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_4			MMIO32(PORT_IOBUS_BASE + 0x134)
/** PORT_IOBUS_PMUX2_5 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_5			MMIO32(PORT_IOBUS_BASE + 0x135)
/** PORT_IOBUS_PMUX2_6 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_6			MMIO32(PORT_IOBUS_BASE + 0x136)
/** PORT_IOBUS_PMUX2_7 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_7			MMIO32(PORT_IOBUS_BASE + 0x137)
/** PORT_IOBUS_PMUX2_8 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_8			MMIO32(PORT_IOBUS_BASE + 0x138)
/** PORT_IOBUS_PMUX2_9 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_9			MMIO32(PORT_IOBUS_BASE + 0x139)
/** PORT_IOBUS_PMUX2_10 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_10			MMIO32(PORT_IOBUS_BASE + 0x13a)
/** PORT_IOBUS_PMUX2_11 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_11			MMIO32(PORT_IOBUS_BASE + 0x13b)
/** PORT_IOBUS_PMUX2_12 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_12			MMIO32(PORT_IOBUS_BASE + 0x13c)
/** PORT_IOBUS_PMUX2_13 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_13			MMIO32(PORT_IOBUS_BASE + 0x13d)
/** PORT_IOBUS_PMUX2_14 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_14			MMIO32(PORT_IOBUS_BASE + 0x13e)
/** PORT_IOBUS_PMUX2_15 Peripheral Multiplexing n - Group 2 **/
#define PORT_IOBUS_PMUX2_15			MMIO32(PORT_IOBUS_BASE + 0x13f)
/** PORT_IOBUS_PINCFG2_0 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_0			MMIO32(PORT_IOBUS_BASE + 0x140)
/** PORT_IOBUS_PINCFG2_1 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_1			MMIO32(PORT_IOBUS_BASE + 0x141)
/** PORT_IOBUS_PINCFG2_2 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_2			MMIO32(PORT_IOBUS_BASE + 0x142)
/** PORT_IOBUS_PINCFG2_3 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_3			MMIO32(PORT_IOBUS_BASE + 0x143)
/** PORT_IOBUS_PINCFG2_4 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_4			MMIO32(PORT_IOBUS_BASE + 0x144)
/** PORT_IOBUS_PINCFG2_5 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_5			MMIO32(PORT_IOBUS_BASE + 0x145)
/** PORT_IOBUS_PINCFG2_6 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_6			MMIO32(PORT_IOBUS_BASE + 0x146)
/** PORT_IOBUS_PINCFG2_7 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_7			MMIO32(PORT_IOBUS_BASE + 0x147)
/** PORT_IOBUS_PINCFG2_8 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_8			MMIO32(PORT_IOBUS_BASE + 0x148)
/** PORT_IOBUS_PINCFG2_9 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_9			MMIO32(PORT_IOBUS_BASE + 0x149)
/** PORT_IOBUS_PINCFG2_10 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_10			MMIO32(PORT_IOBUS_BASE + 0x14a)
/** PORT_IOBUS_PINCFG2_11 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_11			MMIO32(PORT_IOBUS_BASE + 0x14b)
/** PORT_IOBUS_PINCFG2_12 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_12			MMIO32(PORT_IOBUS_BASE + 0x14c)
/** PORT_IOBUS_PINCFG2_13 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_13			MMIO32(PORT_IOBUS_BASE + 0x14d)
/** PORT_IOBUS_PINCFG2_14 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_14			MMIO32(PORT_IOBUS_BASE + 0x14e)
/** PORT_IOBUS_PINCFG2_15 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_15			MMIO32(PORT_IOBUS_BASE + 0x14f)
/** PORT_IOBUS_PINCFG2_16 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_16			MMIO32(PORT_IOBUS_BASE + 0x150)
/** PORT_IOBUS_PINCFG2_17 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_17			MMIO32(PORT_IOBUS_BASE + 0x151)
/** PORT_IOBUS_PINCFG2_18 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_18			MMIO32(PORT_IOBUS_BASE + 0x152)
/** PORT_IOBUS_PINCFG2_19 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_19			MMIO32(PORT_IOBUS_BASE + 0x153)
/** PORT_IOBUS_PINCFG2_20 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_20			MMIO32(PORT_IOBUS_BASE + 0x154)
/** PORT_IOBUS_PINCFG2_21 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_21			MMIO32(PORT_IOBUS_BASE + 0x155)
/** PORT_IOBUS_PINCFG2_22 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_22			MMIO32(PORT_IOBUS_BASE + 0x156)
/** PORT_IOBUS_PINCFG2_23 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_23			MMIO32(PORT_IOBUS_BASE + 0x157)
/** PORT_IOBUS_PINCFG2_24 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_24			MMIO32(PORT_IOBUS_BASE + 0x158)
/** PORT_IOBUS_PINCFG2_25 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_25			MMIO32(PORT_IOBUS_BASE + 0x159)
/** PORT_IOBUS_PINCFG2_26 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_26			MMIO32(PORT_IOBUS_BASE + 0x15a)
/** PORT_IOBUS_PINCFG2_27 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_27			MMIO32(PORT_IOBUS_BASE + 0x15b)
/** PORT_IOBUS_PINCFG2_28 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_28			MMIO32(PORT_IOBUS_BASE + 0x15c)
/** PORT_IOBUS_PINCFG2_29 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_29			MMIO32(PORT_IOBUS_BASE + 0x15d)
/** PORT_IOBUS_PINCFG2_30 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_30			MMIO32(PORT_IOBUS_BASE + 0x15e)
/** PORT_IOBUS_PINCFG2_31 Pin Configuration n - Group 2 **/
#define PORT_IOBUS_PINCFG2_31			MMIO32(PORT_IOBUS_BASE + 0x15f)

/**@}*/


