grevaillot/svd_tools/headers/ATSAMR21E16A/port_iobus.h
/** @defgroup port_iobus_pmux0_8 PMUX08 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_8_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_8_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_8_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_8_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_8_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_8_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_9 PMUX09 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_9_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_9_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_9_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_9_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_9_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_9_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_10 PMUX010 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_10_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_10_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_10_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_10_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_10_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_10_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_11 PMUX011 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_11_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_11_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_11_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_11_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_11_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_11_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_12 PMUX012 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_12_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_12_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_12_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_12_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_12_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_12_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_13 PMUX013 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_13_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_13_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_13_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_13_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_13_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_13_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_14 PMUX014 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_14_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_14_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_14_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_14_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_14_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_14_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_15 PMUX015 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_15_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_15_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_15_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_15_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_15_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_15_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pincfg0_0 PINCFG00 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_0_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_0_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_0_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_0_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_0_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_0_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_0_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_0_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_1 PINCFG01 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_1_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_1_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_1_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_1_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_1_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_1_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_1_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_1_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_2 PINCFG02 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_2_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_2_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_2_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_2_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_2_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_2_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_2_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_2_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_3 PINCFG03 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_3_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_3_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_3_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_3_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_3_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_3_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_3_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_3_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_4 PINCFG04 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_4_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_4_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_4_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_4_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_4_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_4_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_4_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_4_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_5 PINCFG05 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_5_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_5_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_5_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_5_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_5_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_5_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_5_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_5_PMUXEN		(1 << 0)

/**@}*/

