grevaillot/svd_tools/headers/ATSAMR21E16A/port_iobus.h
/** PORT_IOBUS_PINCFG0_18_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_18_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_18_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_18_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_18_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_18_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_18_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_18_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_19 PINCFG019 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_19_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_19_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_19_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_19_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_19_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_19_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_19_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_19_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_20 PINCFG020 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_20_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_20_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_20_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_20_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_20_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_20_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_20_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_20_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_21 PINCFG021 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_21_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_21_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_21_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_21_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_21_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_21_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_21_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_21_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_22 PINCFG022 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_22_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_22_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_22_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_22_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_22_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_22_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_22_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_22_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_23 PINCFG023 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_23_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_23_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_23_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_23_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_23_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_23_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_23_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_23_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_24 PINCFG024 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_24_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_24_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_24_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_24_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_24_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_24_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_24_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_24_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_25 PINCFG025 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_25_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_25_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_25_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_25_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_25_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_25_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_25_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_25_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_26 PINCFG026 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_26_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_26_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_26_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_26_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_26_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_26_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_26_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_26_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_27 PINCFG027 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_27_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_27_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_27_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_27_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_27_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_27_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_27_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_27_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_28 PINCFG028 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_28_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_28_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_28_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_28_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_28_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_28_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_28_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_28_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_29 PINCFG029 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_29_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_29_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_29_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_29_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_29_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_29_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_29_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_29_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_30 PINCFG030 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_30_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_30_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_30_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_30_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_30_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_30_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_30_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_30_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_31 PINCFG031 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_31_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_31_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_31_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_31_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_31_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_31_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_31_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_PINCFG0_31_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_dir1 DIR1 Data Direction
@{*/


#define PORT_IOBUS_DIR1_DIR_SHIFT		0
#define PORT_IOBUS_DIR1_DIR_MASK		0xffffffff
/** @defgroup port_iobus_dir1_dir DIR Port Data Direction
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_dirclr1 DIRCLR1 Data Direction Clear
@{*/


#define PORT_IOBUS_DIRCLR1_DIRCLR_SHIFT		0
#define PORT_IOBUS_DIRCLR1_DIRCLR_MASK		0xffffffff
/** @defgroup port_iobus_dirclr1_dirclr DIRCLR Port Data Direction Clear
@{*/
/**@}*/


/**@}*/

