grevaillot/svd_tools/headers/ATSAMR21E16A/port_iobus.h
/** @defgroup port_iobus_dirset1 DIRSET1 Data Direction Set
@{*/


#define PORT_IOBUS_DIRSET1_DIRSET_SHIFT		0
#define PORT_IOBUS_DIRSET1_DIRSET_MASK		0xffffffff
/** @defgroup port_iobus_dirset1_dirset DIRSET Port Data Direction Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_dirtgl1 DIRTGL1 Data Direction Toggle
@{*/


#define PORT_IOBUS_DIRTGL1_DIRTGL_SHIFT		0
#define PORT_IOBUS_DIRTGL1_DIRTGL_MASK		0xffffffff
/** @defgroup port_iobus_dirtgl1_dirtgl DIRTGL Port Data Direction Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_out1 OUT1 Data Output Value
@{*/


#define PORT_IOBUS_OUT1_OUT_SHIFT		0
#define PORT_IOBUS_OUT1_OUT_MASK		0xffffffff
/** @defgroup port_iobus_out1_out OUT Port Data Output Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_outclr1 OUTCLR1 Data Output Value Clear
@{*/


#define PORT_IOBUS_OUTCLR1_OUTCLR_SHIFT		0
#define PORT_IOBUS_OUTCLR1_OUTCLR_MASK		0xffffffff
/** @defgroup port_iobus_outclr1_outclr OUTCLR Port Data Output Value Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_outset1 OUTSET1 Data Output Value Set
@{*/


#define PORT_IOBUS_OUTSET1_OUTSET_SHIFT		0
#define PORT_IOBUS_OUTSET1_OUTSET_MASK		0xffffffff
/** @defgroup port_iobus_outset1_outset OUTSET Port Data Output Value Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_outtgl1 OUTTGL1 Data Output Value Toggle
@{*/


#define PORT_IOBUS_OUTTGL1_OUTTGL_SHIFT		0
#define PORT_IOBUS_OUTTGL1_OUTTGL_MASK		0xffffffff
/** @defgroup port_iobus_outtgl1_outtgl OUTTGL Port Data Output Value Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_in1 IN1 Data Input Value
@{*/


#define PORT_IOBUS_IN1_IN_SHIFT		0
#define PORT_IOBUS_IN1_IN_MASK		0xffffffff
/** @defgroup port_iobus_in1_in IN Port Data Input Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_ctrl1 CTRL1 Control
@{*/


#define PORT_IOBUS_CTRL1_SAMPLING_SHIFT		0
#define PORT_IOBUS_CTRL1_SAMPLING_MASK		0xffffffff
/** @defgroup port_iobus_ctrl1_sampling SAMPLING Input Sampling Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_wrconfig1 WRCONFIG1 Write Configuration
@{*/

/** PORT_IOBUS_WRCONFIG1_HWSEL Half-Word Select **/
#define PORT_IOBUS_WRCONFIG1_HWSEL		(1 << 31)
/** PORT_IOBUS_WRCONFIG1_WRPINCFG Write PINCFG **/
#define PORT_IOBUS_WRCONFIG1_WRPINCFG		(1 << 30)
/** PORT_IOBUS_WRCONFIG1_WRPMUX Write PMUX **/
#define PORT_IOBUS_WRCONFIG1_WRPMUX		(1 << 28)

#define PORT_IOBUS_WRCONFIG1_PMUX_SHIFT		24
#define PORT_IOBUS_WRCONFIG1_PMUX_MASK		0x0f
/** @defgroup port_iobus_wrconfig1_pmux PMUX Peripheral Multiplexing
@{*/
/**@}*/

/** PORT_IOBUS_WRCONFIG1_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_WRCONFIG1_DRVSTR		(1 << 22)
/** PORT_IOBUS_WRCONFIG1_PULLEN Pull Enable **/
#define PORT_IOBUS_WRCONFIG1_PULLEN		(1 << 18)
/** PORT_IOBUS_WRCONFIG1_INEN Input Enable **/
#define PORT_IOBUS_WRCONFIG1_INEN		(1 << 17)
/** PORT_IOBUS_WRCONFIG1_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_WRCONFIG1_PMUXEN		(1 << 16)

#define PORT_IOBUS_WRCONFIG1_PINMASK_SHIFT		0
#define PORT_IOBUS_WRCONFIG1_PINMASK_MASK		0xffff
/** @defgroup port_iobus_wrconfig1_pinmask PINMASK Pin Mask for Multiple Pin Configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux1_0 PMUX10 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_1 PMUX11 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_2 PMUX12 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_3 PMUX13 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_4 PMUX14 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_5 PMUX15 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_6 PMUX16 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_7 PMUX17 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_8 PMUX18 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_9 PMUX19 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_10 PMUX110 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_11 PMUX111 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_12 PMUX112 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_13 PMUX113 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_14 PMUX114 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_15 PMUX115 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_0 PINCFG10 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_1 PINCFG11 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_2 PINCFG12 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_3 PINCFG13 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_4 PINCFG14 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_5 PINCFG15 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_6 PINCFG16 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_7 PINCFG17 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_8 PINCFG18 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_9 PINCFG19 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_10 PINCFG110 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_11 PINCFG111 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_12 PINCFG112 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_13 PINCFG113 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_14 PINCFG114 Pin Configuration n - Group 1
@{*/


/**@}*/

