grevaillot/svd_tools/headers/ATSAMR21E16A/port_iobus.h
/** @defgroup port_iobus_pincfg1_15 PINCFG115 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_16 PINCFG116 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_17 PINCFG117 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_18 PINCFG118 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_19 PINCFG119 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_20 PINCFG120 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_21 PINCFG121 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_22 PINCFG122 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_23 PINCFG123 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_24 PINCFG124 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_25 PINCFG125 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_26 PINCFG126 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_27 PINCFG127 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_28 PINCFG128 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_29 PINCFG129 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_30 PINCFG130 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_31 PINCFG131 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_dir2 DIR2 Data Direction
@{*/


#define PORT_IOBUS_DIR2_DIR_SHIFT		0
#define PORT_IOBUS_DIR2_DIR_MASK		0xffffffff
/** @defgroup port_iobus_dir2_dir DIR Port Data Direction
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_dirclr2 DIRCLR2 Data Direction Clear
@{*/


#define PORT_IOBUS_DIRCLR2_DIRCLR_SHIFT		0
#define PORT_IOBUS_DIRCLR2_DIRCLR_MASK		0xffffffff
/** @defgroup port_iobus_dirclr2_dirclr DIRCLR Port Data Direction Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_dirset2 DIRSET2 Data Direction Set
@{*/


#define PORT_IOBUS_DIRSET2_DIRSET_SHIFT		0
#define PORT_IOBUS_DIRSET2_DIRSET_MASK		0xffffffff
/** @defgroup port_iobus_dirset2_dirset DIRSET Port Data Direction Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_dirtgl2 DIRTGL2 Data Direction Toggle
@{*/


#define PORT_IOBUS_DIRTGL2_DIRTGL_SHIFT		0
#define PORT_IOBUS_DIRTGL2_DIRTGL_MASK		0xffffffff
/** @defgroup port_iobus_dirtgl2_dirtgl DIRTGL Port Data Direction Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_out2 OUT2 Data Output Value
@{*/


#define PORT_IOBUS_OUT2_OUT_SHIFT		0
#define PORT_IOBUS_OUT2_OUT_MASK		0xffffffff
/** @defgroup port_iobus_out2_out OUT Port Data Output Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_outclr2 OUTCLR2 Data Output Value Clear
@{*/


#define PORT_IOBUS_OUTCLR2_OUTCLR_SHIFT		0
#define PORT_IOBUS_OUTCLR2_OUTCLR_MASK		0xffffffff
/** @defgroup port_iobus_outclr2_outclr OUTCLR Port Data Output Value Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_outset2 OUTSET2 Data Output Value Set
@{*/


#define PORT_IOBUS_OUTSET2_OUTSET_SHIFT		0
#define PORT_IOBUS_OUTSET2_OUTSET_MASK		0xffffffff
/** @defgroup port_iobus_outset2_outset OUTSET Port Data Output Value Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_outtgl2 OUTTGL2 Data Output Value Toggle
@{*/


#define PORT_IOBUS_OUTTGL2_OUTTGL_SHIFT		0
#define PORT_IOBUS_OUTTGL2_OUTTGL_MASK		0xffffffff
/** @defgroup port_iobus_outtgl2_outtgl OUTTGL Port Data Output Value Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_in2 IN2 Data Input Value
@{*/


#define PORT_IOBUS_IN2_IN_SHIFT		0
#define PORT_IOBUS_IN2_IN_MASK		0xffffffff
/** @defgroup port_iobus_in2_in IN Port Data Input Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_ctrl2 CTRL2 Control
@{*/


#define PORT_IOBUS_CTRL2_SAMPLING_SHIFT		0
#define PORT_IOBUS_CTRL2_SAMPLING_MASK		0xffffffff
/** @defgroup port_iobus_ctrl2_sampling SAMPLING Input Sampling Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_wrconfig2 WRCONFIG2 Write Configuration
@{*/

/** PORT_IOBUS_WRCONFIG2_HWSEL Half-Word Select **/
#define PORT_IOBUS_WRCONFIG2_HWSEL		(1 << 31)
/** PORT_IOBUS_WRCONFIG2_WRPINCFG Write PINCFG **/
#define PORT_IOBUS_WRCONFIG2_WRPINCFG		(1 << 30)
/** PORT_IOBUS_WRCONFIG2_WRPMUX Write PMUX **/
#define PORT_IOBUS_WRCONFIG2_WRPMUX		(1 << 28)

#define PORT_IOBUS_WRCONFIG2_PMUX_SHIFT		24
#define PORT_IOBUS_WRCONFIG2_PMUX_MASK		0x0f
/** @defgroup port_iobus_wrconfig2_pmux PMUX Peripheral Multiplexing
@{*/
/**@}*/

/** PORT_IOBUS_WRCONFIG2_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_WRCONFIG2_DRVSTR		(1 << 22)
/** PORT_IOBUS_WRCONFIG2_PULLEN Pull Enable **/
#define PORT_IOBUS_WRCONFIG2_PULLEN		(1 << 18)
/** PORT_IOBUS_WRCONFIG2_INEN Input Enable **/
#define PORT_IOBUS_WRCONFIG2_INEN		(1 << 17)
/** PORT_IOBUS_WRCONFIG2_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_IOBUS_WRCONFIG2_PMUXEN		(1 << 16)

#define PORT_IOBUS_WRCONFIG2_PINMASK_SHIFT		0
#define PORT_IOBUS_WRCONFIG2_PINMASK_MASK		0xffff
/** @defgroup port_iobus_wrconfig2_pinmask PINMASK Pin Mask for Multiple Pin Configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux2_0 PMUX20 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_1 PMUX21 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_2 PMUX22 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_3 PMUX23 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_4 PMUX24 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_5 PMUX25 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_6 PMUX26 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_7 PMUX27 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_8 PMUX28 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_9 PMUX29 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_10 PMUX210 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_11 PMUX211 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

